Revit 2026 API

# ControlledApplicationDocumentClosing Event

---

Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<DocumentClosingEventArgs> DocumentClosing
```
```vb
Public Event DocumentClosing As EventHandler(Of DocumentClosingEventArgs)
```
```cpp
public:
 event EventHandler<DocumentClosingEventArgs^>^ DocumentClosing {
	void add (EventHandler<DocumentClosingEventArgs^>^ value);
	void remove (EventHandler<DocumentClosingEventArgs^>^ value);
}
```
```fsharp
member DocumentClosing : IEvent<EventHandler<DocumentClosingEventArgs>,
    DocumentClosingEventArgs>
```

#### Value

EventHandlerDocumentClosingEventArgs

This event is raised when Revit is just about to close a document.

This event is cancellable, except when it is raised during close of the application. Check the 'Cancellable' property of event's argument to see whether it is cancellable or not. When it is cancellable, set the 'Cancel' property in event's argument to True to cancel it. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The document may not be modified during this event.

The following API functions are not available for the current document during this event:

  * Close and similar overloads.

Exception InvalidOperationException will be thrown if any of the above methods is called during this event.

Another DocumentClosed event will be raised immediately after document is closed.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace